### 1- Create an SQL query or queries to extract the information you think may be relevant for building the prediction model. It should include some film features and some rental features

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import getpass
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix
password = getpass.getpass()

········

In [7]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
query = '''
       select r.rental_id, f.film_id, f.rating, f.length, date_format(convert(rental_date,date), '%m') as Activity_Month, date_format(convert(rental_date,date), '%Y') as Activity_year
from rental r
join inventory i
on i.inventory_id = r.inventory_id
join film f
on f.film_id = i.film_id;
        '''

### 2- Read the data into a Pandas dataframe

In [8]:
data = pd.read_sql_query(query, engine)
data

       rental_id  film_id rating  length Activity_Month Activity_year
0           4863        1     PG      86             07          2005
1          11433        1     PG      86             08          2005
2          14714        1     PG      86             08          2005
3            972        1     PG      86             05          2005
4           2117        1     PG      86             06          2005
...          ...      ...    ...     ...            ...           ...
16039        711     1000  NC-17      50             05          2005
16040       1493     1000  NC-17      50             06          2005
16041       6712     1000  NC-17      50             07          2005
16042       9701     1000  NC-17      50             07          2005
16043      12894     1000  NC-17      50             08          2005

[16044 rows x 6 columns]

### 3- Analyze extracted features and transform them. You may need to encode some categorical variables, or scale numerical variables

In [9]:
data = pd.get_dummies(data)
data.head()

,rental_id,film_id,length,rating_G,rating_NC-17,rating_PG,rating_PG-13,rating_R,Activity_Month_02,Activity_Month_05,Activity_Month_06,Activity_Month_07,Activity_Month_08,Activity_year_2005,Activity_year_2006
0,4863,1,86,0,0,1,0,0,0,0,0,1,0,1,0
1,11433,1,86,0,0,1,0,0,0,0,0,0,1,1,0
2,14714,1,86,0,0,1,0,0,0,0,0,0,1,1,0
3,972,1,86,0,0,1,0,0,0,1,0,0,0,1,0
4,2117,1,86,0,0,1,0,0,0,0,1,0,0,1,0

### 4- Create a query to get the list of films and a boolean indicating if it was rented last month. This would be our target variable

In [ ]:
I'm not sure what to do

### 5- Create a logistic regression model to predict this variable from the cleaned data

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [ ]:
classification = LogisticRegression(random_state=42, multi_class='multinomial', max_iter=500) 
classification.fit(X_train, y_train)

### 6- Evaluate the results (calculate the score of the model)

In [ ]:
classification.score(X_test, y_test)

In [ ]:
confusion_matrix(y_test, predictions)